# ProjectLocationName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..ProjectLocationName Property
SunAndShadowSettings Class See Also
---
Identifies the name of the project location used by the SunAndShadowSettings element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string ProjectLocationName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectLocationName As String
	Get
```

Visual C++
---
```text
public:
property String^ ProjectLocationName {
	String^ get ();
}
```

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace